app/Models/Admin_Users.php

UPDATE `admin_users` SET `user_session_id` = 170832986410888
WHERE `user_id` = ('1')
---
    public function updateData()
{
        $builder = $this->db->table("admin_users");

        $updated_data = $this->data;

        $builder->where([
            "user_id" => $this->primary_key
        ]);
        $builder->set($updated_data);

        return $builder->update();